//TESTPTKT JOB MSGCLASS=X,MSGLEVEL=(1,1)
//STEP1    EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  /* Define APPLID TSTAPPL that can be used by SDKTST1 user */
  RDEFINE APPL TSTAPPL UACC(NONE)
  PERMIT TSTAPPL CL(APPL) ACCESS(READ) ID(SDKTST1)
  PERMIT TSTAPPL CL(APPL) ACCESS(NONE) ID(SDKBLD1)
  SETROPTS RACLIST(APPL) REFRESH

  /* Activate PassTickets in RACF, if not activated */
  SETROPTS CLASSACT(PTKTDATA)
  SETROPTS RACLIST(PTKTDATA)
  SETROPTS GENERIC(PTKTDATA)

  /* Define PassTicket for APPLID TSTAPPL without replay protection */
  RDEFINE PTKTDATA TSTAPPL SSIGNON(KEYMASKED(66f4f9331e095436)) +
    APPLDATA('NO REPLAY PROTECTION') UACC(NONE)
  SETROPTS RACLIST(PTKTDATA) REFRESH

  /* Allow user SDKBLD1 to generate PassTickets for TSTAPPL */
  RDEFINE PTKTDATA IRRPTAUTH.TSTAPPL.* UACC(NONE)
  PERMIT IRRPTAUTH.TSTAPPL.* CL(PTKTDATA) ID(SDKBLD1) ACCESS(UPDATE)
  SETROPTS RACLIST(PTKTDATA) REFRESH

