//TESTPTKT JOB MSGCLASS=X,MSGLEVEL=(1,1)
//STEP1    EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//SYSTSIN  DD *
  /* Define PassTicket for APPLID TSTAPPL without replay protection */
  TSS ADDTO(NDT) PSTKAPPL(TSTAPPL) SESSKEY(66f4f9331e095436) SIGNMULTI
  /* Allow user SDKBLD1 to generate PassTickets for TSTAPPL */
  TSS PERMIT(SDKBLD1) PTKTDATA(IRRPTAUTH.TSTAPPL.) ACCESS(READ,UPDATE)
  TSS REFRESH
